doc/camera.md
```mermaid
 sequenceDiagram
  	participant Activity
    
    ContextImpl -> SystemServiceRegistry: SystemServiceRegistry.createServiceCache()
    SystemServiceRegistry -> SystemServiceRegistry: static 代码块中 registerService 
    
    Activity -> ContextImpl: getSystemService(CAMERA_SERVICE)
    ContextImpl -> SystemServiceRegistry: getSystemService(this, name)
    SystemServiceRegistry -> ServiceFetcher: getService(ctx)
    SystemServiceRegistry <-- ServiceFetcher: return new CameraManager(ctx)
    ContextImpl <-- SystemServiceRegistry: return CameraManager
    Activity <-- ContextImpl: return CameraManager
```
